Revit 2027 API
SymbolicCurve.GetVisibility Method
Gets the visibility for the symbolic curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyElementVisibility GetVisibility()
Public Function GetVisibility As FamilyElementVisibility
public:
FamilyElementVisibility^ GetVisibility()
member GetVisibility : unit -> FamilyElementVisibility
Return Value
FamilyElementVisibility
A copy of visibility settings for the symbolic curve.
See Also
Reference
SymbolicCurve Class
Autodesk.Revit.DB Namespace